#+TITLE: Database Server in C
#+AUTHOR: Cristian Del Gobbo (pledged)
#+STARTUP: overview hideblocks indent
#+PROPERTY: header-args:C :main yes :includes <stdio.h> <stdbool.h> <fcntl.h> <stdarg.h> <stddef.h> <stdlib.h> <string.h> <arpa/inet.h> <unistd.h> <assert.h> <errno.h> <sys/socket.h> <netinet/in.h> :results output :noweb yes

* Implementing a Binary Tree
Define the structure of the three by creating Nodes, Leaves and the Tree.
#+name: bin_tree
#+begin_src C 
  #define TagRoot 1 /* 00 01 */
  #define TagNode 2 /* 00 10 */
  #define TagLeaf 4 /* 01 00 */

  #define NoError 0
  #define ExampleFile "./wl.txt"

  // Define a Null pointer
  typedef void* Nullptr;
  Nullptr nullptr = 0;

  // Macro for the function that find the last leaf (Only need to chage the Macro)
  #define find_last(x) find_last_linear(x)
  #define find_leaf(x,y) find_leaf_linear(x,y)
  #define lookup(x,y) lookup_linear(x,y)
  #define find_node(x) find_node_linear(x)
  #define reterr(x)\		
  errno = (x);\
  return nullptr; // return a null pointer

  #define Print(x)				\
    zero(buf, 256);				\
    strncpy((char *)buf, (char *)(x), 255);	\
    size = (int16)strlen((char *)buf);		\
    if(size)					\
      write(fd, (char *)buf, size)

  typedef unsigned int int32;
  typedef unsigned short int int16;
  typedef unsigned char int8;
  typedef unsigned char Tag;

  struct s_node{
    Tag tag; // Help keep track of the kind of structure
    struct s_node* north; // up link
    struct s_node* west; // left link
    struct s_leaf* east; // right link, only leaves
    int8 path[256]; // Contain the path
  };
  typedef struct s_node Node;

  struct s_leaf{
    Tag tag;
    union u_tree* west; // Connect to the left
    struct s_leaf* east;
    int8 key[128];
    int8* value; // Pointer to the value, allocate it separately
    int16 size; // size of the value
  };
  typedef struct s_leaf Leaf;

  union u_tree{ // All variable in the union share the same memory space
    Node n; // One Node or one Leaf, not both at the same time
    Leaf l;
  };
  typedef union u_tree Tree;

#+end_src

#+RESULTS: bin_tree

Define the tree root
#+name: tree_root
#+begin_src C
  <<bin_tree>>
    // Create the root of the tree
  Tree root = {
      .n = { // Node
        .tag = (TagRoot | TagNode),
        .north = (Node *)&root, // Point to itself
        .west = 0,
        .east = 0,
        .path = "/"
      }
    };
#+end_src

#+RESULTS: tree_root

Function to create and link nodes
#+name: create_node
#+begin_src C
  <<tree_root>>

    // Create zero function
  void zero(int8* str, int16 size){
    int8* p;
    int16 n;

    for(n=0, p=str; n < size; p++, n++)
      ,*p = 0;

    return;
    }

  // Function to create node
  Node* create_node(Node* parent, int8* path){
    Node* n;
    int16 size = sizeof(struct s_node);


    errno = NoError;
    assert(parent);
    n = (Node *)malloc((int)size);
    zero((int8 *)n, size);

    // Define the parent, pointing to this node
    parent -> west = n;

    // Initialize fields inside of n
    n->tag = TagNode;
    n->north = (Node *)parent; // Tree *
    strncpy((char *)n->path, (char *)path, 255);

    return n;
  }


  // Main function for testing purposes
  /*int main(){ 
    Node* n, *n2; 
    n = create_node((Node *)&root, (int8 *)"/Users");
    assert(n);
    n2 = create_node(n, (int8 *)"/Users/login");
    assert(n2);

    // Print addreses
    printf("Address of n: %p\n", &n);
    printf("Address of n2: %p\n", &n2);
    free(n2);
    free(n);
    return 0;
    }*/ 
#+end_src

#+RESULTS: create_node

Create a Leaf
#+name: create_leaf
#+begin_src C
  <<create_node>>

    // Function to find the last leaf
  Leaf* find_last_linear(Node* parent){ // Linear search for the moment
    Leaf* l;

    errno = NoError;
    assert(parent);

    if(!parent){
      fprintf(stderr, "Error: parent is NULL\n");
      return NULL;
    }

    if(!parent->east)
      return (Leaf *)0; // Return Error

    // Loop as long as l as an east "Brother"
    for(l = parent->east; l->east; l = l->east); // l will be the leaf on the last east position    
    assert(l);

    return l;
    }

  // Function to create a new leaf
  Leaf* create_leaf(Node* parent, int8* key, int8* value, int16 count){
    Leaf* l, *new;
    int16 size;


    assert(parent);
    l = find_last(parent); // last leaf
    size = sizeof(struct s_leaf);
    new = (Leaf *)malloc(size);
    assert(new);

    if(!l){ // Directly connected with the parent 
      parent->east = new;
    }
    else
      // l is a leaf
      l->east = new;

    // Initialize fields of the leaf
    zero((int8 *)new, size);
    new->tag = TagLeaf;
    new->west = (!l) ? (Tree *)parent : (Tree *)l;

    strncpy((char *)new->key, (char *)key, 127);
    new->value = (int8 *)malloc(count);
    zero(new->value, count);
    assert(new->value);
    strncpy((char *)new->value, (char *)value, count);
    new->size = count;

    return new;
  }

  // Test the creation of a leaf
  /*int main(){
    Node* n, *n2; 
    Leaf* l1, *l2;
    int8* key, *value;
    int16 size;

    n = create_node((Node *)&root, (int8 *)"/Users");
    assert(n);
    n2 = create_node(n, (int8 *)"/Users/login");
    assert(n2);

    key = (int8 *)"Cristian"; // Name of the user
    value = (int8 *)"abc77301";
    size = (int16)strlen((char *)value);
    l1 = create_leaf(n2, key, value, size);
    assert(l1);
    l2 = create_leaf(n, "Utente", "edf83938", size);
    assert(l2);
    // Print addreses of Nodes
    printf("Address of n: %p\n", &n);
    printf("Address of n2: %p\n", &n2);

    puts("");
    // Print values of Leaves
    printf("Value of l1: %s\n", l1->value);
    printf("Key of l1: %s\n", l1->key);
    puts("");
    printf("Value of l2: %s\n", l2->value);    
    printf("Key of l2: %s\n", l2->key);

    return 0;
    }*/
#+end_src

#+RESULTS: create_leaf

Create a pretty printer
#+name: pretty
#+begin_src C :tangle pretty.c
  <<create_leaf>>

    // Create helper functions
  int8* indent(int16 n){ // return string with 2*n spaces
    int16 i;
    static int8 buf[256];
    int8* p;

    if(n < 1)
      return (int8 *)"";
    assert(n < 120);
    zero(buf, 256);

    for(i=0, p=buf; i<n; i++, p+=2)
      strcpy((char *)p, "  ");

    return buf; 
    }

  // Pretty printer
  void print_tree(int fd, Tree* _root){
    int8 indentation;
    int8 buf[256];
    int16 size;
    Node* n;
    Leaf* l, *last;

    indentation = 0;
    for(n = (Node *)_root; n; n = n->west){
      Print(indent(indentation++));
      Print(n->path);
      Print("\n");
      if(n->east){
        last = find_last(n);
        if(last)
          for(l = last;(Node *)l->west != n; l = (Leaf *)l->west){
            Print(indent(indentation));
            Print(n->path);
            Print("/");
            Print(l->key);
            Print(" -> '");
            write(fd, (char *)l->value, (int)l->size);
            Print("'\n");
          } 
      }
    }
    return;
  }

#+end_src

#+RESULTS: pretty
: /
:   /Users
:     /Users/login

